app/controllers/listings_controller.rb

  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 7 ORDER BY created_at DESC

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings" ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    if current_user.recipient.blank?
      recipient = Stripe::Recipient.create(
        :name => current_user.name,
        :type => "individual",
        :bank_account => token
        )
    end
      current_user.recipient = recipient.id
      current_user.save
---
INSERT INTO "listings" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 10 Jul 2014 01:17:05 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Thu, 10 Jul 2014 01:17:05 UTC +00:00]]
UPDATE "users" SET "recipient" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["recipient", "rp_14NwMj4WPSBPdJ8ioy30kzGm"], ["updated_at", Tue, 05 Aug 2014 01:03:49 UTC +00:00]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 2  [["image_file_name", "Billboard.jpg"], ["image_file_size", 39944], ["image_updated_at", Sat, 19 Jul 2014 01:40:58 UTC +00:00], ["updated_at", Sat, 19 Jul 2014 01:40:59 UTC +00:00]]