app/controllers/orders_controller.rb

  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 7 ORDER BY created_at_DESC

  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 7 ORDER BY created_at DESC

  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "11"]]

  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.seller_id = @seller.id
    @order.buyer_id = current_user.id

    respond_to do |format|
      if @order.save
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "orders" ("address", "buyer_id", "city", "created_at", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "R. Urussui, 71"], ["buyer_id", 7], ["city", "Sao Paulo"], ["created_at", Mon, 28 Jul 2014 22:49:00 UTC +00:00], ["state", "SP"], ["updated_at", Mon, 28 Jul 2014 22:49:00 UTC +00:00]]